zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_rcu.h
/*!
    \file    gd32c2x1_rcu.h
    \brief   definitions for the RCU

    \version 2025-08-08, V1.1.0, firmware for gd32c2x1
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32C2X1_RCU_H
#define GD32C2X1_RCU_H

#include "gd32c2x1.h"

/* RCU definitions */
#define RCU                         RCU_BASE

/* registers definitions */
#define RCU_CTL0                    REG32(RCU + 0x00000000U)        /*!< control 0 register */
#define RCU_CFG0                    REG32(RCU + 0x00000008U)        /*!< configuration register 0 */
#define RCU_INT                     REG32(RCU + 0x0000000CU)        /*!< interrupt register */
#define RCU_AHB1RST                 REG32(RCU + 0x00000010U)        /*!< AHB1 reset register */
#define RCU_AHB2RST                 REG32(RCU + 0x00000014U)        /*!< AHB1 reset register */
#define RCU_APBRST                  REG32(RCU + 0x00000024U)        /*!< APB reset register */
#define RCU_AHB1EN                  REG32(RCU + 0x00000030U)        /*!< AHB1 enable register */
#define RCU_AHB2EN                  REG32(RCU + 0x00000034U)        /*!< AHB2 enable register */
#define RCU_APBEN                   REG32(RCU + 0x00000044U)        /*!< APB enable register */
#define RCU_AHB1SPDPEN              REG32(RCU + 0x00000050U)        /*!< AHB1 sleep and deep sleep mode enable register */
#define RCU_AHB2SPDPEN              REG32(RCU + 0x00000054U)        /*!< AHB2 sleep and deep sleep mode enable register */
#define RCU_APBSPDPEN               REG32(RCU + 0x00000064U)        /*!< APB sleep and deep sleep mode enable register */
#define RCU_CTL1                    REG32(RCU + 0x00000070U)        /*!< control 1 register */
#define RCU_RSTSCK                  REG32(RCU + 0x00000074U)        /*!< reset source /clock register */
#define RCU_CFG1                    REG32(RCU + 0x0000008CU)        /*!< configuration register 1 */

/* bits definitions */
/* RCU_CTL0 */
#define RCU_CTL0_IRC48MEN            BIT(0)                          /*!< internal high speed oscillator enable */
#define RCU_CTL0_IRC48MSTB           BIT(1)                          /*!< IRC48M high speed internal oscillator stabilization flag */
#define RCU_CTL0_IRC48MADJ           BITS(3,7)                       /*!< high speed internal oscillator clock trim adjust value */
#define RCU_CTL0_IRC48MCALIB         BITS(8,15)                      /*!< high speed internal oscillator calibration value register */
#define RCU_CTL0_HXTALEN             BIT(16)                         /*!< external high speed oscillator enable */
#define RCU_CTL0_HXTALSTB            BIT(17)                         /*!< external crystal oscillator clock stabilization flag */
#define RCU_CTL0_HXTALBPS            BIT(18)                         /*!< external crystal oscillator clock bypass mode enable */
#define RCU_CTL0_CKMEN               BIT(19)                         /*!< HXTAL clock monitor enable */
#define RCU_CTL0_IRC48MDIV_PER       BITS(25,27)                     /*!< IRC48M clock divider factor for peripheral clock */
#define RCU_CTL0_IRC48M_PEREN        BIT(28)                         /*!< IRC48M always-enable for peripheral */
#define RCU_CTL0_IRC48MDIV_SYS       BITS(29,31)                     /*!< IRC48M clock divider factor for system clock */

/* RCU_CFG0 */
#define RCU_CFG0_SCS                BITS(0,1)                       /*!< system clock switch */
#define RCU_CFG0_SCSS               BITS(2,3)                       /*!< system clock switch status */
#define RCU_CFG0_AHBPSC             BITS(4,7)                       /*!< AHB prescaler selection */
#define RCU_CFG0_APBPSC             BITS(11,13)                     /*!< APB prescaler selection */
#define RCU_CFG0_CKOUT1SEL          BITS(16,18)                     /*!< CK_OUT1 clock source selection */
#define RCU_CFG0_CKOUT1DIV          BITS(20,22)                     /*!< CK_OUT1 divider which the CK_OUT frequency can be reduced */
#define RCU_CFG0_CKOUT0SEL          BITS(24,26)                     /*!< CK_OUT0 clock source selection */
#define RCU_CFG0_CKOUT0DIV          BITS(28,30)                     /*!< CK_OUT0 divider which the CK_OUT frequency can be reduced */

/* RCU_INT */
#define RCU_INT_IRC32KSTBIF         BIT(0)                          /*!< IRC32K stabilization interrupt flag */
#define RCU_INT_LXTALSTBIF          BIT(1)                          /*!< LXTAL stabilization interrupt flag */
#define RCU_INT_IRC48MSTBIF         BIT(2)                          /*!< IRC48MM stabilization interrupt flag */
#define RCU_INT_LCKMIF              BIT(6)                          /*!< LXTAL clock stuck interrupt flag */
#define RCU_INT_IRC32KSTBIE         BIT(8)                          /*!< IRC32K stabilization interrupt enable */
#define RCU_INT_LXTALSTBIE          BIT(9)                          /*!< LXTAL stabilization interrupt enable */
#define RCU_INT_IRC48MSTBIE         BIT(10)                         /*!< IRC48M stabilization interrupt enable */
#define RCU_INT_IRC32KSTBIC         BIT(16)                         /*!< IRC32K stabilization interrupt clear */
#define RCU_INT_LXTALSTBIC          BIT(17)                         /*!< LXTAL stabilization interrupt clear */
#define RCU_INT_IRC48MSTBIC         BIT(18)                         /*!< IRC48M stabilization interrupt clear */
#define RCU_INT_LCKMIC              BIT(22)                         /*!< LXTAL clock stuck interrupt clear */
#define RCU_INT_HXTALSTBIF          BIT(3)                          /*!< HXTAL stabilization interrupt flag */
#define RCU_INT_CKMIF               BIT(7)                          /*!< HXTAL clock stuck interrupt flag */
#define RCU_INT_HXTALSTBIE          BIT(11)                         /*!< HXTAL stabilization interrupt enable */
#define RCU_INT_HXTALSTBIC          BIT(19)                         /*!< HXTAL stabilization interrupt clear */
#define RCU_INT_CKMIC               BIT(23)                         /*!< HXTAL clock stuck interrupt clear */

/* RCU_AHB1RST */
#define RCU_AHB1RST_CRCRST          BIT(12)                         /*!< CRC */
#define RCU_AHB1RST_DMARST          BIT(21)                         /*!< DMA reset */
#define RCU_AHB1RST_DMAMUXRST       BIT(23)                         /*!< DMAMUX reset */

/* RCU_AHB2RST */
#define RCU_AHB2RST_PARST           BIT(17)                         /*!< PA reset */
#define RCU_AHB2RST_PBRST           BIT(18)                         /*!< PB reset */
#define RCU_AHB2RST_PCRST           BIT(19)                         /*!< PC reset */
#define RCU_AHB2RST_PDRST           BIT(20)                         /*!< PD reset */
#define RCU_AHB2RST_PFRST           BIT(22)                         /*!< PF reset */

/* RCU_APBRST */
#define RCU_APBRST_SYSCFGRST        BIT(0)                          /*!< system configuration reset */
#define RCU_APBRST_CMPRST           BIT(1)                          /*!< comparator reset */
#define RCU_APBRST_WWDGTRST         BIT(8)                          /*!< comparator reset */
#define RCU_APBRST_ADCRST           BIT(9)                          /*!< ADC reset */
#define RCU_APBRST_TIMER0RST        BIT(10)                         /*!< TIMER0 reset */
#define RCU_APBRST_TIMER2RST        BIT(11)                         /*!< TIMER2 reset */
#define RCU_APBRST_SPI0RST          BIT(12)                         /*!< SPI0 reset */
#define RCU_APBRST_SPI1RST          BIT(13)                         /*!< SPI1 reset */
#define RCU_APBRST_USART0RST        BIT(14)                         /*!< USART0 reset */
#define RCU_APBRST_USART1RST        BIT(15)                         /*!< USART1 reset */
#define RCU_APBRST_TIMER13RST       BIT(16)                         /*!< TIMER13 reset */
#define RCU_APBRST_TIMER15RST       BIT(17)                         /*!< TIMER15 reset */
#define RCU_APBRST_TIMER16RST       BIT(18)                         /*!< TIMER16 reset */
#define RCU_APBRST_USART2RST        BIT(19)                         /*!< USART2 reset */
#define RCU_APBRST_I2C0RST          BIT(21)                         /*!< I2C0 reset */
#define RCU_APBRST_I2C1RST          BIT(22)                         /*!< I2C1 reset */
#define RCU_APBRST_PMURST           BIT(28)                         /*!< PMU reset */

/* RCU_AHB1EN */
#define RCU_AHB1EN_FMCEN            BIT(4)                          /*!< FMC enable */
#define RCU_AHB1EN_CRCEN            BIT(12)                         /*!< CRC enable*/
#define RCU_AHB1EN_DMAEN            BIT(21)                         /*!< DMA enable */
#define RCU_AHB1EN_DMAMUXEN         BIT(23)                         /*!< DMAMUX enable */

/* RCU_AHB2EN */
#define RCU_AHB2EN_PAEN             BIT(17)                         /*!< PA enable */
#define RCU_AHB2EN_PBEN             BIT(18)                         /*!< PB enable */
#define RCU_AHB2EN_PCEN             BIT(19)                         /*!< PC enable */
#define RCU_AHB2EN_PDEN             BIT(20)                         /*!< PD enable */
#define RCU_AHB2EN_PFEN             BIT(22)                         /*!< PF enable */

/* RCU_APBEN */
#define RCU_APBEN_SYSCFGEN          BIT(0)                          /*!< system configuration enable */
#define RCU_APBEN_CMPEN             BIT(1)                          /*!< comparator enable */
#define RCU_APBEN_WWDGTEN           BIT(8)                          /*!< comparator enable */
#define RCU_APBEN_ADCEN             BIT(9)                          /*!< ADC enable */
#define RCU_APBEN_TIMER0EN          BIT(10)                         /*!< TIMER0 enable */
#define RCU_APBEN_TIMER2EN          BIT(11)                         /*!< TIMER2 enable */
#define RCU_APBEN_SPI0EN            BIT(12)                         /*!< SPI0 enable */
#define RCU_APBEN_SPI1EN            BIT(13)                         /*!< SPI0 enable */
#define RCU_APBEN_USART0EN          BIT(14)                         /*!< USART0 enable */
#define RCU_APBEN_USART1EN          BIT(15)                         /*!< USART1 enable */
#define RCU_APBEN_TIMER13EN         BIT(16)                         /*!< TIMER13 enable */
#define RCU_APBEN_TIMER15EN         BIT(17)                         /*!< TIMER15 enable */
#define RCU_APBEN_TIMER16EN         BIT(18)                         /*!< TIMER16 enable */
#define RCU_APBEN_USART2EN          BIT(19)                         /*!< USART2 enable */
#define RCU_APBEN_I2C0EN            BIT(21)                         /*!< I2C0 enable */
#define RCU_APBEN_I2C1EN            BIT(22)                         /*!< I2C1 enable */
#define RCU_APBEN_DBGEN             BIT(27)                         /*!< DBG enable */
#define RCU_APBEN_PMUEN             BIT(28)                         /*!< PMU enable */

/* RCU_AHB1SPDPEN */
#define RCU_AHB1SPDPEN_SRAMEN       BIT(2)                          /*!< SRAM enable */
#define RCU_AHB1SPDPEN_FMCEN        BIT(4)                          /*!< FMC enable */
#define RCU_AHB1SPDPEN_CRCEN        BIT(12)                         /*!< CRC enable*/
#define RCU_AHB1SPDPEN_DMAEN        BIT(21)                         /*!< DMA enable */
#define RCU_AHB1SPDPEN_DMAMUXEN     BIT(23)                         /*!< DMAMUX enable */

/* RCU_AHB2SPDPEN */
#define RCU_AHB2SPDPEN_PAEN         BIT(17)                         /*!< PA enable */
#define RCU_AHB2SPDPEN_PBEN         BIT(18)                         /*!< PB enable */
#define RCU_AHB2SPDPEN_PCEN         BIT(19)                         /*!< PC enable */
#define RCU_AHB2SPDPEN_PDEN         BIT(20)                         /*!< PD enable */
#define RCU_AHB2SPDPEN_PFEN         BIT(22)                         /*!< PF enable */

/* RCU_APBSPDPEN */
#define RCU_APBSPDPEN_SYSCFGEN       BIT(0)                         /*!< system configuration enable */
#define RCU_APBSPDPEN_CMPEN          BIT(1)                         /*!< comparator enable */
#define RCU_APBSPDPEN_WWDGTEN        BIT(8)                         /*!< comparator enable */
#define RCU_APBSPDPEN_ADCEN          BIT(9)                         /*!< ADC enable */
#define RCU_APBSPDPEN_TIMER0EN       BIT(10)                        /*!< TIMER0 enable */
#define RCU_APBSPDPEN_TIMER2EN       BIT(11)                        /*!< TIMER2 enable */
#define RCU_APBSPDPEN_SPI0EN         BIT(12)                        /*!< SPI0 enable */
#define RCU_APBSPDPEN_SPI1EN         BIT(13)                        /*!< SPI1 enable */
#define RCU_APBSPDPEN_USART0EN       BIT(14)                        /*!< USART0 enable */
#define RCU_APBSPDPEN_USART1EN       BIT(15)                        /*!< USART1 enable */
#define RCU_APBSPDPEN_TIMER13EN      BIT(16)                        /*!< TIMER13 enable */
#define RCU_APBSPDPEN_TIMER15EN      BIT(17)                        /*!< TIMER15 enable */
#define RCU_APBSPDPEN_TIMER16EN      BIT(18)                        /*!< TIMER16 enable */
#define RCU_APBSPDPEN_USART2EN       BIT(19)                        /*!< USART2 enable */
#define RCU_APBSPDPEN_I2C0EN         BIT(21)                        /*!< I2C0 enable */
#define RCU_APBSPDPEN_I2C1EN         BIT(22)                        /*!< I2C1 enable */
#define RCU_APBSPDPEN_PMUEN          BIT(28)                        /*!< PMU enable */

/* RCU_CTL1 */
#define RCU_CTL1_LXTALEN             BIT(0)                         /*!< LXTAL enable */
#define RCU_CTL1_LXTALSTB            BIT(1)                         /*!< external low-speed oscillator stabilization */
#define RCU_CTL1_LXTALBPS            BIT(2)                         /*!< LXTAL bypass mode enable */
#define RCU_CTL1_LXTALDRI            BIT(3)                         /*!< LXTAL drive capability */
#define RCU_CTL1_LCKMEN              BIT(5)                         /*!< LXTAL clock monitor enable */
#define RCU_CTL1_LCKMD               BIT(6)                         /*!< LXTAL clock failure detection */
#define RCU_CTL1_LXTALSTBRST         BIT(7)                         /*!< external low-speed oscillator stabilization reset*/
#define RCU_CTL1_RTCSRC              BITS(8,9)                      /*!< RTC clock entry selection */
#define RCU_CTL1_RTCEN               BIT(15)                        /*!< RTC clock enable */
#define RCU_CTL1_BKPRST              BIT(16)                        /*!< backup domain reset */
#define RCU_CTL1_LSCKOUTEN           BIT(24)                        /*!< Low speed clock output enable */
#define RCU_CTL1_LSCKOUTSEL          BIT(25)                        /*!< Low speed clock output selection */

/* RCU_RSTSCK */
#define RCU_RSTSCK_IRC32KEN         BIT(0)                          /*!< IRC32K enable */
#define RCU_RSTSCK_IRC32KSTB        BIT(1)                          /*!< IRC32K stabilization */
#define RCU_RSTSCK_OBLRSTF          BIT(23)                         /*!< option byte loader reset flag */
#define RCU_RSTSCK_RSTFC            BIT(24)                         /*!< reset flag clear */
#define RCU_RSTSCK_EPRSTF           BIT(26)                         /*!< external pin reset flag */
#define RCU_RSTSCK_PORRSTF          BIT(27)                         /*!< power reset flag */
#define RCU_RSTSCK_SWRSTF           BIT(28)                         /*!< software reset flag */
#define RCU_RSTSCK_FWDGTRSTF        BIT(29)                         /*!< free watchdog timer reset flag */
#define RCU_RSTSCK_WWDGTRSTF        BIT(30)                         /*!< window watchdog timer reset flag */
#define RCU_RSTSCK_LPRSTF           BIT(31)                         /*!< low-power reset flag */

/* RCU_CFG1 */
#define RCU_CFG1_USART0SEL          BITS(0,1)                        /*!< CK_USART0 clock source selection */
#define RCU_CFG1_I2C0SEL            BITS(2,3)                        /*!< CK_I2C0 clock source selection */
#define RCU_CFG1_I2C1SEL            BITS(4,5)                        /*!< CK_I2C1 clock source selection */
#define RCU_CFG1_ADCSEL             BITS(7,8)                        /*!< CK_ADC clock source selection */
#define RCU_CFG1_ADCPSC             BITS(9,12)                       /*!< ADC clock prescaler selection */
#define RCU_CFG1_I2SSEL             BITS(14,15)                      /*!< I2S clock source selection */

/* constants definitions */
/* define the peripheral clock enable bit position and its register index offset */
#define RCU_REGIDX_BIT(regidx, bitpos)      (((uint32_t)(regidx)<<6) | (uint32_t)(bitpos))
#define RCU_REG_VAL(periph)                 (REG32(RCU + ((uint32_t)(periph)>>6)))
#define RCU_BIT_POS(val)                    ((uint32_t)(val) & 0x1FU)

