zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_rcu.h
/* register index */
/* peripherals enable */
#define AHB1EN_REG_OFFSET               0x30U                                    /*!< AHB1 enable register offset */
#define AHB2EN_REG_OFFSET               0x34U                                    /*!< AHB2 enable register offset */
#define APBEN_REG_OFFSET                0x44U                                    /*!< APB enable register offset */

/* peripherals reset */
#define AHB1RST_REG_OFFSET              0x10U                                    /*!< AHB1 reset register offset */
#define AHB2RST_REG_OFFSET              0x14U                                    /*!< AHB2 reset register offset */
#define APBRST_REG_OFFSET               0x24U                                    /*!< APB reset register offset */

/* peripherals sleep mode and deepsleep mode enable */
#define AHB1SPDPEN_REG_OFFSET           0x50U                                    /*!< AHB1 reset register offset */
#define AHB2SPDPEN_REG_OFFSET           0x54U                                    /*!< AHB2 reset register offset */
#define APBSPDPEN_REG_OFFSET            0x64U                                    /*!< APB reset register offset */

/* reset source and clock */
#define RSTSCK_REG_OFFSET               0x74U                                    /*!< reset source/clock register offset */

/* clock control */
#define CTL0_REG_OFFSET                 0x00U                                    /*!< control register 0 offset */  
#define CTL1_REG_OFFSET                 0x70U                                    /*!< control register 1 offset */

/* clock stabilization and stuck interrupt */
#define INT_REG_OFFSET                  0x0CU                                    /*!< clock interrupt register offset */

/* configuration register */
#define CFG0_REG_OFFSET                 0x08U                                    /*!< clock configuration register 0 offset */
#define CFG1_REG_OFFSET                 0x8CU                                    /*!< clock configuration register 1 offset */

/* peripheral clock enable */
typedef enum {
    /* AHB1 peripherals */
    RCU_FMC     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 4U),                         /*!< FMC clock */
    RCU_CRC     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 12U),                        /*!< CRC clock */
    RCU_DMA     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 21U),                        /*!< DMA clock */
    RCU_DMAMUX  = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 23U),                        /*!< DMAMUX clock */
    
    /* AHB2 peripherals */
    RCU_GPIOA   = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 17U),                        /*!< GPIOA clock */
    RCU_GPIOB   = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 18U),                        /*!< GPIOB clock */
    RCU_GPIOC   = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 19U),                        /*!< GPIOC clock */
    RCU_GPIOD   = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 20U),                        /*!< GPIOD clock */
    RCU_GPIOF   = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 22U),                        /*!< GPIOF clock */

    /* APB peripherals */
    RCU_SYSCFG  = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 0U),                          /*!< SYSCFG clock */
    RCU_CMP     = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 1U),                          /*!< CMP clock */
    RCU_WWDGT   = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 8U),                          /*!< WWDGT clock */
    RCU_ADC     = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 9U),                          /*!< ADC clock */
    RCU_TIMER0  = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 10U),                         /*!< TIMER0 clock */
    RCU_TIMER2  = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 11U),                         /*!< TIMER2 clock */
    RCU_SPI0    = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 12U),                         /*!< SPI0 clock */
    RCU_SPI1    = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 13U),                         /*!< SPI1 clock */
    RCU_USART0  = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 14U),                         /*!< USART0 clock */
    RCU_USART1  = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 15U),                         /*!< USART1 clock */
    RCU_TIMER13 = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 16U),                         /*!< TIMER13 clock */
    RCU_TIMER15 = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 17U),                         /*!< TIMER15 clock */
    RCU_TIMER16 = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 18U),                         /*!< TIMER16 clock */
    RCU_USART2  = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 19U),                         /*!< USART2 clock */
    RCU_I2C0    = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 21U),                         /*!< I2C0 clock */
    RCU_I2C1    = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 22U),                         /*!< I2C1 clock */
    RCU_DBGMCU  = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 27U),                         /*!< DBGMCU clock */
    RCU_PMU     = RCU_REGIDX_BIT(APBEN_REG_OFFSET, 28U),                         /*!< PMU clock */

    /* control register 1(RCU_CTL1) */
    RCU_RTC     = RCU_REGIDX_BIT(CTL1_REG_OFFSET, 15U)                           /*!< RTC clock */
} rcu_periph_enum;

/* peripheral clock enable when sleep mode*/
typedef enum {
    /* AHB1 peripherals */
    RCU_SRAM_SLP    = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 2U),                 /*!< SRAM clock */
    RCU_FMC_SLP     = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 4U),                 /*!< FMC clock */
    RCU_CRC_SLP     = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 12U),                /*!< CRC clock */
    RCU_DMA_SLP     = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 21U),                /*!< DMA clock */
    RCU_DMAMUX_SLP  = RCU_REGIDX_BIT(AHB1SPDPEN_REG_OFFSET, 23U),                /*!< DMAMUX clock */
    
    /* AHB2 peripherals */
    RCU_GPIOA_SLP   = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 17U),                /*!< GPIOA clock */
    RCU_GPIOB_SLP   = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 18U),                /*!< GPIOB clock */
    RCU_GPIOC_SLP   = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 19U),                /*!< GPIOC clock */
    RCU_GPIOD_SLP   = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 20U),                /*!< GPIOD clock */
    RCU_GPIOF_SLP   = RCU_REGIDX_BIT(AHB2SPDPEN_REG_OFFSET, 22U),                /*!< GPIOF clock */

