zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_rcu.h
    /* APB peripherals */
    RCU_SYSCFG_SLP  = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 0U),                  /*!< SYSCFG clock */
    RCU_CMP_SLP     = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 1U),                  /*!< CMP clock */
    RCU_WWDGT_SLP   = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 8U),                  /*!< WWDGT clock */
    RCU_ADC_SLP     = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 9U),                  /*!< ADC clock */
    RCU_TIMER0_SLP  = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 10U),                 /*!< TIMER0 clock */
    RCU_TIMER2_SLP  = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 11U),                 /*!< TIMER2 clock */
    RCU_SPI0_SLP    = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 12U),                 /*!< SPI0 clock */
    RCU_SPI1_SLP    = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 13U),                 /*!< SPI1 clock */
    RCU_USART0_SLP  = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 14U),                 /*!< USART0 clock */
    RCU_USART1_SLP  = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 15U),                 /*!< USART1 clock */
    RCU_TIMER13_SLP = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 16U),                 /*!< TIMER13 clock */
    RCU_TIMER15_SLP = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 17U),                 /*!< TIMER15 clock */
    RCU_TIMER16_SLP = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 18U),                 /*!< TIMER16 clock */
    RCU_USART2_SLP  = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 19U),                 /*!< USART2 clock */
    RCU_I2C0_SLP    = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 21U),                 /*!< I2C0 clock */
    RCU_I2C1_SLP    = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 22U),                 /*!< I2C1 clock */
    RCU_PMU_SLP     = RCU_REGIDX_BIT(APBSPDPEN_REG_OFFSET, 28U),                 /*!< PMU clock */
} rcu_periph_sleep_enum;

/* peripherals reset */
typedef enum {
    /* AHB1 peripherals */
    RCU_CRCRST     = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 12U),                    /*!< CRC clock */
    RCU_DMARST     = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 21U),                    /*!< DMA clock */
    RCU_DMAMUXRST  = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 23U),                    /*!< DMA clock */
                                        
    /* AHB2 peripherals */              
    RCU_GPIOARST   = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 17U),                    /*!< GPIOA clock */
    RCU_GPIOBRST   = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 18U),                    /*!< GPIOB clock */
    RCU_GPIOCRST   = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 19U),                    /*!< GPIOC clock */
    RCU_GPIODRST   = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 20U),                    /*!< GPIOD clock */
    RCU_GPIOFRST   = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 22U),                    /*!< GPIOF clock */
                                      
    /* APB peripherals */             
    RCU_SYSCFGRST  = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 0U),                      /*!< SYSCFG clock */
    RCU_CMPRST     = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 1U),                      /*!< CMP clock */
    RCU_WWDGTRST   = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 8U),                      /*!< WWDGT clock */
    RCU_ADCRST     = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 9U),                      /*!< ADC clock */
    RCU_TIMER0RST  = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 10U),                     /*!< TIMER0 clock */
    RCU_TIMER2RST  = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 11U),                     /*!< TIMER2 clock */
    RCU_SPI0RST    = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 12U),                     /*!< SPI0 clock */
    RCU_SPI1RST    = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 13U),                     /*!< SPI1 clock */
    RCU_USART0RST  = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 14U),                     /*!< USART0 clock */
    RCU_USART1RST  = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 15U),                     /*!< USART1 clock */
    RCU_TIMER13RST = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 16U),                     /*!< TIMER13 clock */
    RCU_TIMER15RST = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 17U),                     /*!< TIMER15 clock */
    RCU_TIMER16RST = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 18U),                     /*!< TIMER16 clock */
    RCU_USART2RST  = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 19U),                     /*!< USART2 clock */
    RCU_I2C0RST    = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 21U),                     /*!< I2C0 clock */
    RCU_I2C1RST    = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 22U),                     /*!< I2C1 clock */
    RCU_PMURST     = RCU_REGIDX_BIT(APBRST_REG_OFFSET, 28U),                     /*!< PMU clock */
} rcu_periph_reset_enum;

/* clock stabilization, peripheral reset and clock dection flags */
typedef enum {
    /* clock stabilization flags */
    RCU_FLAG_IRC32KSTB    = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 1U),               /*!< IRC32K stabilization flag */
    RCU_FLAG_LXTALSTB     = RCU_REGIDX_BIT(CTL1_REG_OFFSET, 1U),                 /*!< LXTAL stabilization flag */
    RCU_FLAG_IRC48MSTB    = RCU_REGIDX_BIT(CTL0_REG_OFFSET, 1U),                 /*!< IRC48M stabilization flag */
    RCU_FLAG_HXTALSTB     = RCU_REGIDX_BIT(CTL0_REG_OFFSET, 17U),                /*!< HXTAL stabilization flag */

    /* reset source flags */
    RCU_FLAG_OBLRST       = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 23U),              /*!< option byte loader reset flag */
    RCU_FLAG_EPRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 26U),              /*!< External PIN reset flag */
    RCU_FLAG_PORRST       = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 27U),              /*!< power reset flag */
    RCU_FLAG_SWRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 28U),              /*!< SW reset flag */
    RCU_FLAG_FWDGTRST     = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 29U),              /*!< FWDGT reset flag */
    RCU_FLAG_WWDGTRST     = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 30U),              /*!< WWDGT reset flag */
    RCU_FLAG_LPRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 31U),              /*!< low-power reset flag */
    /* clock failure flag */
    RCU_FLAG_LCKCMD       = RCU_REGIDX_BIT(CTL1_REG_OFFSET, 6U)                  /*!< LXTAL clock failure detection flag */
} rcu_flag_enum;

/* clock stabilization and ckm interrupt flags */
typedef enum {
    RCU_INT_FLAG_IRC32KSTB = RCU_REGIDX_BIT(INT_REG_OFFSET, 0U),                 /*!< IRC32K stabilization interrupt flag */
    RCU_INT_FLAG_LXTALSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 1U),                 /*!< LXTAL stabilization interrupt flag */
    RCU_INT_FLAG_IRC48MSTB = RCU_REGIDX_BIT(INT_REG_OFFSET, 2U),                 /*!< IRC48M stabilization interrupt flag */
    RCU_INT_FLAG_LXTALCKM  = RCU_REGIDX_BIT(INT_REG_OFFSET, 6U),                 /*!< LXTAL clock stuck interrupt flag */
    RCU_INT_FLAG_HXTALSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 3U),                 /*!< HXTAL stabilization interrupt flag */
    RCU_INT_FLAG_CKM       = RCU_REGIDX_BIT(INT_REG_OFFSET, 7U),                 /*!< CKM interrupt flag */
} rcu_int_flag_enum;

