zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_rcu.h
/* clock stabilization and stuck interrupt flags clear */
typedef enum {
    RCU_INT_FLAG_IRC32KSTB_CLR = RCU_REGIDX_BIT(INT_REG_OFFSET, 16U),            /*!< IRC32K stabilization interrupt flags clear */
    RCU_INT_FLAG_LXTALSTB_CLR  = RCU_REGIDX_BIT(INT_REG_OFFSET, 17U),            /*!< LXTAL stabilization interrupt flags clear */
    RCU_INT_FLAG_IRC48MSTB_CLR = RCU_REGIDX_BIT(INT_REG_OFFSET, 18U),            /*!< IRC48M stabilization interrupt flags clear */
    RCU_INT_FLAG_LXTALCKM_CLR  = RCU_REGIDX_BIT(INT_REG_OFFSET, 22U),            /*!< LXTAL clock stuck interrupt flag clear */
    RCU_INT_FLAG_HXTALSTB_CLR  = RCU_REGIDX_BIT(INT_REG_OFFSET, 19U),            /*!< HXTAL stabilization interrupt flags clear */
    RCU_INT_FLAG_CKM_CLR       = RCU_REGIDX_BIT(INT_REG_OFFSET, 23U),            /*!< CKM interrupt flags clear */
} rcu_int_flag_clear_enum;

/* clock stabilization interrupt enable or disable */
typedef enum {
    RCU_INT_IRC32KSTB       = RCU_REGIDX_BIT(INT_REG_OFFSET, 8U),                /*!< IRC32K stabilization interrupt */
    RCU_INT_LXTALSTB        = RCU_REGIDX_BIT(INT_REG_OFFSET, 9U),                /*!< LXTAL stabilization interrupt */
    RCU_INT_IRC48MSTB       = RCU_REGIDX_BIT(INT_REG_OFFSET, 10U),               /*!< IRC48M stabilization interrupt */
    RCU_INT_HXTALSTB        = RCU_REGIDX_BIT(INT_REG_OFFSET, 11U),               /*!< HXTAL stabilization interrupt */
} rcu_int_enum;

/* oscillator types */
typedef enum {
    RCU_HXTAL   = RCU_REGIDX_BIT(CTL0_REG_OFFSET, 16U),                          /*!< HXTAL */
    RCU_LXTAL   = RCU_REGIDX_BIT(CTL1_REG_OFFSET, 0U),                           /*!< LXTAL */
    RCU_IRC48M  = RCU_REGIDX_BIT(CTL0_REG_OFFSET, 0U),                           /*!< IRC48M */
    RCU_IRC32K  = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 0U),                         /*!< IRC32K */
} rcu_osci_type_enum;

/* rcu clock frequency */
typedef enum {
    CK_SYS      = 0U,                                                            /*!< system clock */
    CK_AHB,                                                                      /*!< AHB clock */
    CK_APB,                                                                      /*!< APB clock */
    CK_ADC,                                                                      /*!< ADC clock */
    CK_USART0,                                                                   /*!< USART0 clock */
    CK_I2C0,                                                                     /*!< I2C0 clock */
    CK_I2C1,                                                                     /*!< I2C1 clock */
    CK_I2C2,                                                                     /*!< I2C2 clock */
    CK_USART1,                                                                   /*!< USART1 clock */
} rcu_clock_freq_enum;

typedef enum {
    IDX_USART0 = 0U,                                                             /*!< index of USART0 */
    IDX_USART1                                                                   /*!< index of USART1 */
} usart_idx_enum;

typedef enum {
    IDX_I2C0 = 0U,                                                               /*!< index of I2C0 */
    IDX_I2C1,                                                                    /*!< index of I2C1 */
} i2c_idx_enum;

/* IRC48MDIV_SYS clock source selection */
#define CTL_IRC48MDIV_SYS_SEL(regval)    (BITS(29,31) & ((uint32_t)(regval) << 29U))
#define RCU_IRC48MDIV_SYS_1              CTL_IRC48MDIV_SYS_SEL(0)                /*!< CK_IRC48MDIV_SYS select CK_IRC48M */
#define RCU_IRC48MDIV_SYS_2              CTL_IRC48MDIV_SYS_SEL(1)                /*!< CK_IRC48MDIV_SYS select CK_IRC48M divided by 2 */
#define RCU_IRC48MDIV_SYS_4              CTL_IRC48MDIV_SYS_SEL(2)                /*!< CK_IRC48MDIV_SYS select CK_IRC48M divided by 4 */
#define RCU_IRC48MDIV_SYS_8              CTL_IRC48MDIV_SYS_SEL(3)                /*!< CK_IRC48MDIV_SYS select CK_IRC48M divided by 8 */
#define RCU_IRC48MDIV_SYS_16             CTL_IRC48MDIV_SYS_SEL(4)                /*!< CK_IRC48MDIV_SYS select CK_IRC48M divided by 16 */
#define RCU_IRC48MDIV_SYS_32             CTL_IRC48MDIV_SYS_SEL(5)                /*!< CK_IRC48MDIV_SYS select CK_IRC48M divided by 32 */
#define RCU_IRC48MDIV_SYS_64             CTL_IRC48MDIV_SYS_SEL(6)                /*!< CK_IRC48MDIV_SYS select CK_IRC48M divided by 64 */
#define RCU_IRC48MDIV_SYS_128            CTL_IRC48MDIV_SYS_SEL(7)                /*!< CK_IRC48MDIV_SYS select CK_IRC48M divided by 128 */

/* IRC48MDIV_PER clock source selection */
#define CTL_IRC48MDIV_PER_SEL(regval)    (BITS(25,27) & ((uint32_t)(regval) << 25U))
#define RCU_IRC48MDIV_PER_1              CTL_IRC48MDIV_PER_SEL(0)                /*!< CK_IRC48MDIV_PER select CK_IRC48M */
#define RCU_IRC48MDIV_PER_2              CTL_IRC48MDIV_PER_SEL(1)                /*!< CK_IRC48MDIV_PER select CK_IRC48M divided by 2 */
#define RCU_IRC48MDIV_PER_3              CTL_IRC48MDIV_PER_SEL(2)                /*!< CK_IRC48MDIV_PER select CK_IRC48M divided by 3 */
#define RCU_IRC48MDIV_PER_4              CTL_IRC48MDIV_PER_SEL(3)                /*!< CK_IRC48MDIV_PER select CK_IRC48M divided by 4 */
#define RCU_IRC48MDIV_PER_5              CTL_IRC48MDIV_PER_SEL(4)                /*!< CK_IRC48MDIV_PER select CK_IRC48M divided by 5 */
#define RCU_IRC48MDIV_PER_6              CTL_IRC48MDIV_PER_SEL(5)                /*!< CK_IRC48MDIV_PER select CK_IRC48M divided by 6 */
#define RCU_IRC48MDIV_PER_7              CTL_IRC48MDIV_PER_SEL(6)                /*!< CK_IRC48MDIV_PER select CK_IRC48M divided by 7 */
#define RCU_IRC48MDIV_PER_8              CTL_IRC48MDIV_PER_SEL(7)                /*!< CK_IRC48MDIV_PER select CK_IRC48M divided by 8 */

/* system clock source select */
#define CFG0_SCS(regval)            (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define RCU_CKSYSSRC_IRC48MDIV_SYS   CFG0_SCS(0)                                 /*!< system clock source select CK_IRC48MDIV_SYS */
#define RCU_CKSYSSRC_HXTAL           CFG0_SCS(1)                                 /*!< system clock source select HXTAL */
#define RCU_CKSYSSRC_IRC32K          CFG0_SCS(2)                                 /*!< system clock source select IRC32K */
#define RCU_CKSYSSRC_LXTAL           CFG0_SCS(3)                                 /*!< system clock source select LXTAL */

/* system clock source select status */
#define CFG0_SCSS(regval)           (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define RCU_SCSS_IRC48MDIV           CFG0_SCSS(0)                                /*!< system clock source select IRC48M */
#define RCU_SCSS_HXTAL               CFG0_SCSS(1)                                /*!< system clock source select HXTAL */
#define RCU_SCSS_IRC32K              CFG0_SCSS(2)                                /*!< system clock source select IRC32K */
#define RCU_SCSS_LXTAL               CFG0_SCSS(3)                                /*!< system clock source select LXTAL */

/* AHB prescaler selection */
#define CFG0_AHBPSC(regval)         (BITS(4,7) & ((uint32_t)(regval) << 4U))
#define RCU_AHB_CKSYS_DIV1          CFG0_AHBPSC(0)                               /*!< AHB prescaler select CK_SYS */
#define RCU_AHB_CKSYS_DIV2          CFG0_AHBPSC(8)                               /*!< AHB prescaler select CK_SYS/2 */
#define RCU_AHB_CKSYS_DIV4          CFG0_AHBPSC(9)                               /*!< AHB prescaler select CK_SYS/4 */
#define RCU_AHB_CKSYS_DIV8          CFG0_AHBPSC(10)                              /*!< AHB prescaler select CK_SYS/8 */
#define RCU_AHB_CKSYS_DIV16         CFG0_AHBPSC(11)                              /*!< AHB prescaler select CK_SYS/16 */
#define RCU_AHB_CKSYS_DIV64         CFG0_AHBPSC(12)                              /*!< AHB prescaler select CK_SYS/64 */
#define RCU_AHB_CKSYS_DIV128        CFG0_AHBPSC(13)                              /*!< AHB prescaler select CK_SYS/128 */
#define RCU_AHB_CKSYS_DIV256        CFG0_AHBPSC(14)                              /*!< AHB prescaler select CK_SYS/256 */
#define RCU_AHB_CKSYS_DIV512        CFG0_AHBPSC(15)                              /*!< AHB prescaler select CK_SYS/512 */

/* APB prescaler selection */
#define CFG0_APBPSC(regval)        (BITS(11,13) & ((uint32_t)(regval) << 11U))
#define RCU_APB_CKAHB_DIV1         CFG0_APBPSC(0)                                /*!< APB prescaler select CK_AHB */
#define RCU_APB_CKAHB_DIV2         CFG0_APBPSC(4)                                /*!< APB prescaler select CK_AHB/2 */
#define RCU_APB_CKAHB_DIV4         CFG0_APBPSC(5)                                /*!< APB prescaler select CK_AHB/4 */
#define RCU_APB_CKAHB_DIV8         CFG0_APBPSC(6)                                /*!< APB prescaler select CK_AHB/8 */
#define RCU_APB_CKAHB_DIV16        CFG0_APBPSC(7)                                /*!< APB prescaler select CK_AHB/16 */

/* CK_OUT0 clock source selection */
#define CFG0_CKOUT0SEL(regval)       (BITS(24,26) & ((uint32_t)(regval) << 24U))
#define RCU_CKOUT0SRC_NONE           CFG0_CKOUT0SEL(0)                           /*!< no clock selected */
#define RCU_CKOUT0SRC_CKSYS          CFG0_CKOUT0SEL(1)                           /*!< CK_OUT0 clock source select CKSYS */
#define RCU_CKOUT0SRC_IRC48M         CFG0_CKOUT0SEL(3)                           /*!< CK_OUT0 clock source select IRC48M */
#define RCU_CKOUT0SRC_HXTAL          CFG0_CKOUT0SEL(4)                           /*!< CK_OUT0 clock source select HXTAL */
#define RCU_CKOUT0SRC_IRC32K         CFG0_CKOUT0SEL(6)                           /*!< CK_OUT0 clock source select IRC32K */
#define RCU_CKOUT0SRC_LXTAL          CFG0_CKOUT0SEL(7)                           /*!< CK_OUT0 clock source select LXTAL */

/* CK_OUT0 divider */
#define CFG0_CKOUT0DIV(regval)       (BITS(28,30) & ((uint32_t)(regval) << 28U))
#define RCU_CKOUT0_DIV1              CFG0_CKOUT0DIV(0)                           /*!< CK_OUT0 is divided by 1 */
#define RCU_CKOUT0_DIV2              CFG0_CKOUT0DIV(1)                           /*!< CK_OUT0 is divided by 2 */
#define RCU_CKOUT0_DIV4              CFG0_CKOUT0DIV(2)                           /*!< CK_OUT0 is divided by 4 */
#define RCU_CKOUT0_DIV8              CFG0_CKOUT0DIV(3)                           /*!< CK_OUT0 is divided by 8 */
#define RCU_CKOUT0_DIV16             CFG0_CKOUT0DIV(4)                           /*!< CK_OUT0 is divided by 16 */
#define RCU_CKOUT0_DIV32             CFG0_CKOUT0DIV(5)                           /*!< CK_OUT0 is divided by 32 */
#define RCU_CKOUT0_DIV64             CFG0_CKOUT0DIV(6)                           /*!< CK_OUT0 is divided by 64 */
#define RCU_CKOUT0_DIV128            CFG0_CKOUT0DIV(7)                           /*!< CK_OUT0 is divided by 128 */

