zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_rcu.h
/* CK_OUT1 clock source selection */
#define CFG0_CKOUT1SEL(regval)       (BITS(16,18) & ((uint32_t)(regval) << 16U))
#define RCU_CKOUT1SRC_NONE           CFG0_CKOUT1SEL(0)                           /*!< no clock selected */
#define RCU_CKOUT1SRC_CKSYS          CFG0_CKOUT1SEL(1)                           /*!< CK_OUT1 clock source select CKSYS  */
#define RCU_CKOUT1SRC_IRC48M         CFG0_CKOUT1SEL(3)                           /*!< CK_OUT1 clock source select IRC48M */
#define RCU_CKOUT1SRC_HXTAL          CFG0_CKOUT1SEL(4)                           /*!< CK_OUT1 clock source select HXTAL */
#define RCU_CKOUT1SRC_IRC32K         CFG0_CKOUT1SEL(6)                           /*!< CK_OUT1 clock source select IRC32K */
#define RCU_CKOUT1SRC_LXTAL          CFG0_CKOUT1SEL(7)                           /*!< CK_OUT1 clock source select LXTAL */

/* CK_OUT1 divider */
#define CFG0_CKOUT1DIV(regval)       (BITS(20,22) & ((uint32_t)(regval) << 20U))
#define RCU_CKOUT1_DIV1              CFG0_CKOUT1DIV(0)                           /*!< CK_OUT1 is divided by 1 */
#define RCU_CKOUT1_DIV2              CFG0_CKOUT1DIV(1)                           /*!< CK_OUT1 is divided by 2 */
#define RCU_CKOUT1_DIV4              CFG0_CKOUT1DIV(2)                           /*!< CK_OUT1 is divided by 4 */
#define RCU_CKOUT1_DIV8              CFG0_CKOUT1DIV(3)                           /*!< CK_OUT1 is divided by 8 */
#define RCU_CKOUT1_DIV16             CFG0_CKOUT1DIV(4)                           /*!< CK_OUT1 is divided by 16 */
#define RCU_CKOUT1_DIV32             CFG0_CKOUT1DIV(5)                           /*!< CK_OUT1 is divided by 32 */
#define RCU_CKOUT1_DIV64             CFG0_CKOUT1DIV(6)                           /*!< CK_OUT1 is divided by 64 */
#define RCU_CKOUT1_DIV128            CFG0_CKOUT1DIV(7)                           /*!< CK_OUT1 is divided by 128 */

/* low speed clock output source selection */
#define RCU_LSCKOUTSRC_IRC32K              (uint32_t)(0X00000000U)               /*!< IRC32K clock selected */
#define RCU_LSCKOUTSRC_LXTAL               RCU_CTL1_LSCKOUTSEL                   /*!< LXTAL clock selected */

/* LXTAL drive capability */
#define RCU_LXTAL_LOWDRI            (uint32_t)(0X00000000U)                      /*!< lower driving capability */
#define RCU_LXTAL_HIGHDRI           RCU_CTL1_LXTALDRI                            /*!< higher driving capability */

/* RTC clock entry selection */
#define CTL1_RTCSRC(regval)        (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define RCU_RTCSRC_NONE             CTL1_RTCSRC(0)                              /*!< no clock selected */
#define RCU_RTCSRC_LXTAL            CTL1_RTCSRC(1)                              /*!< LXTAL selected as RTC source clock */
#define RCU_RTCSRC_IRC32K           CTL1_RTCSRC(2)                              /*!< IRC32K selected as RTC source clock */
#define RCU_RTCSRC_HXTAL_DIV32      CTL1_RTCSRC(3)                              /*!< HXTAL/32 selected as RTC source clock */

/* USART0 clock source selection */
#define CFG1_USART0SEL(regval)      (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define RCU_USART0SRC_CKAPB         CFG1_USART0SEL(0)                           /*!< CK_USART0 select CK_APB */
#define RCU_USART0SRC_CKSYS         CFG1_USART0SEL(1)                           /*!< CK_USART0 select CK_SYS */
#define RCU_USART0SRC_IRC48MDIV_PER CFG1_USART0SEL(2)                           /*!< CK_USART0 select CK_IRC48MDIV_PER */
#define RCU_USART0SRC_LXTAL         CFG1_USART0SEL(3)                           /*!< CK_USART0 select LXTAL */

/* I2Cx(x=0,1) clock source selection */
#define CFG1_I2C0SEL(regval)        (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define RCU_I2CSRC_CKAPB             CFG1_I2C0SEL(0)                            /*!< CK_I2C select CK_APB */
#define RCU_I2CSRC_CKSYS             CFG1_I2C0SEL(1)                            /*!< CK_I2C select CK_SYS */
#define RCU_I2CSRC_IRC48MDIV_PER     CFG1_I2C0SEL(2)                            /*!< CK_I2C select CK_IRC48MDIV_PER */

/* I2S clock source selection */
#define CFG1_I2SSEL(regval)        (BITS(14,15) & ((uint32_t)(regval) << 14U))
#define RCU_I2SSRC_CKSYS             CFG1_I2SSEL(0)                             /*!< CK_I2S select CK_SYS */
#define RCU_I2SSRC_IRC48MDIV_PER     CFG1_I2SSEL(2)                             /*!< CK_I2S select CK_IRC48MDIV_PER */
#define RCU_I2SSRC_CKIN              CFG1_I2SSEL(3)                             /*!< CK_I2S select I2S_CKIN */

/* ADC clock source selection */
#define RCU_ADCSRC_CKSYS                (uint32_t)0x00000000U                    /*!< ADC clock source select CK_SYS */
#define RCU_ADCSRC_IRC48M_PER           (uint32_t)0x00000100U                    /*!< ADC clock source select CK_IRC48MDIV_PER */
#define RCU_ADCSRC_HXTAL                 RCU_CFG1_ADCSEL                         /*!< ADC clock source select CK_HXTAL */

/* ADC clock prescaler selection */
#define CFG1_ADCPSC(regval)         (BITS(9,12) & ((uint32_t)(regval) << 9U))
#define RCU_ADCCK_DIV1               CFG1_ADCPSC(0)                               /*!< ADC clock prescaler select not divided */
#define RCU_ADCCK_DIV2               CFG1_ADCPSC(1)                               /*!< ADC clock prescaler select divided by 2 */
#define RCU_ADCCK_DIV4               CFG1_ADCPSC(2)                               /*!< ADC clock prescaler select divided by 4*/
#define RCU_ADCCK_DIV6               CFG1_ADCPSC(3)                               /*!< ADC clock prescaler select divided by 6*/
#define RCU_ADCCK_DIV8               CFG1_ADCPSC(4)                               /*!< ADC clock prescaler select divided by 8*/
#define RCU_ADCCK_DIV10              CFG1_ADCPSC(5)                               /*!< ADC clock prescaler select divided by 10 */
#define RCU_ADCCK_DIV12              CFG1_ADCPSC(6)                               /*!< ADC clock prescaler select divided by 12 */
#define RCU_ADCCK_DIV16              CFG1_ADCPSC(7)                               /*!< ADC clock prescaler select divided by 16 */
#define RCU_ADCCK_DIV32              CFG1_ADCPSC(8)                               /*!< ADC clock prescaler select divided by 32 */
#define RCU_ADCCK_DIV64              CFG1_ADCPSC(9)                               /*!< ADC clock prescaler select divided by 64 */
#define RCU_ADCCK_DIV128             CFG1_ADCPSC(10)                              /*!< ADC clock prescaler select divided by 128 */
#define RCU_ADCCK_DIV256             CFG1_ADCPSC(11)                              /*!< ADC clock prescaler select divided by 256 */

